In [52]:
!python -m pip install pandas --user

Requirement already satisfied: pandas in c:\users\qnrit\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qnrit\appdata\roaming\python\python313\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qnrit\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qnrit\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qnrit\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\qnrit\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [53]:
import os
os.getcwd()

'C:\\Users\\qnrit\\Desktop'

In [54]:
import pandas as pd
import sqlite3

conn = sqlite3.connect(':memory:')

df = pd.read_csv(r'C:\Users\qnrit\Downloads\insurance.csv')

df.to_sql('insurance', conn, index=False, if_exists='replace')

print("CSV loaded successfully into SQL!")

CSV loaded successfully into SQL!

In [55]:
pd.read_sql_query("SELECT * FROM insurance LIMIT 5;", conn)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [56]:
import pandas as pd

query = "SELECT * FROM insurance;"
pd.read_sql_query(query, conn)

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [57]:
# Female smokers only

query= "SELECT * FROM insurance WHERE sex='female' AND smoker='yes';"
display(pd.read_sql_query(query,conn))

     age     sex     bmi  children smoker     region      charges
0     19  female  27.900         0    yes  southwest  16884.92400
1     62  female  26.290         0    yes  southeast  27808.72510
2     34  female  31.920         1    yes  northeast  37701.87680
3     53  female  22.880         1    yes  southeast  23244.79020
4     20  female  22.420         0    yes  northwest  14711.74380
..   ...     ...     ...       ...    ...        ...          ...
110   25  female  30.200         0    yes  southwest  33900.65300
111   19  female  34.700         2    yes  southwest  36397.57600
112   30  female  23.655         3    yes  northwest  18765.87545
113   42  female  40.370         2    yes  southeast  43896.37630
114   61  female  29.070         0    yes  northwest  29141.36030

[115 rows x 7 columns]

In [58]:
# Avg charges by region

query="""SELECT region,AVG(charges) AS avg_charge
    FROM insurance
    GROUP BY region;"""
display(pd.read_sql_query(query,conn))

      region    avg_charge
0  northeast  13406.384516
1  northwest  12417.575374
2  southeast  14735.411438
3  southwest  12346.937377

In [60]:
#Avg charges by smoker
query="""
SELECT smoker,AVG(charges) AS avg_charge
FROM insurance
GROUP BY smoker"""
display(pd.read_sql_query(query,conn))

  smoker    avg_charge
0     no   8434.268298
1    yes  32050.231832

In [62]:
# Age groups and average charges
query = """
SELECT 
  CASE 
    WHEN age < 30 THEN 'Under 30'
    WHEN age BETWEEN 30 AND 50 THEN '30-50'
    ELSE '50+'
  END AS age_group,
  AVG(charges) AS avg_charge
FROM insurance
GROUP BY age_group;
"""
display(pd.read_sql_query(query, conn))

  age_group    avg_charge
0     30-50  13253.933466
1       50+  18084.987223
2  Under 30   9182.487125

In [63]:
#Top 5 people with highest charges
query="""SELECT * FROM insurance ORDER BY charges DESC LIMIT 5;"""
display(pd.read_sql_query(query,conn))

   age     sex     bmi  children smoker     region      charges
0   54  female  47.410         0    yes  southeast  63770.42801
1   45    male  30.360         0    yes  southeast  62592.87309
2   52    male  34.485         3    yes  northwest  60021.39897
3   31  female  38.095         1    yes  northeast  58571.07448
4   33  female  35.530         0    yes  northwest  55135.40209

In [64]:
# Count of male vs female
query="""SELECT sex, COUNT(*) FROM insurance GROUP BY sex;"""
display(pd.read_sql_query(query,conn))

      sex  COUNT(*)
0  female       662
1    male       676

In [65]:
# Number of children vs average charges
query="""SELECT children, AVG(charges) AS avg_charge FROM insurance GROUP BY children;"""
display(pd.read_sql_query(query,conn))

   children    avg_charge
0         0  12365.975602
1         1  12731.171832
2         2  15073.563734
3         3  15355.318367
4         4  13850.656311
5         5   8786.035247

In [69]:
#Smoker vs Non-Smoker average charges by region
query="""SELECT region,smoker,AVG(charges) AS avg_charge FROM insurance GROUP BY region;"""
display(pd.read_sql_query(query,conn))

      region smoker    avg_charge
0  northeast     no  13406.384516
1  northwest     no  12417.575374
2  southeast     no  14735.411438
3  southwest    yes  12346.937377